# Rename Column Headers In Pandas

## Preliminaries

In [6]:
import pandas as pd

## Create example data

In [7]:
# Create a values as dictionary of lists
raw_data = {'0': ['first_name', 'Molly', 'Tina', 'Jake', 'Amy'],
        '1': ['last_name', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
        '2': ['age', 52, 36, 24, 73],
        '3': ['preTestScore', 24, 31, 2, 3]}
# Create a dataframe
df = pd.DataFrame(raw_data)

# View a dataframe
df

            0          1    2             3
0  first_name  last_name  age  preTestScore
1       Molly   Jacobson   52            24
2        Tina        Ali   36            31
3        Jake     Milner   24             2
4         Amy      Cooze   73             3

## Replace the header value with the first row's values

In [8]:
# Create a new variable called 'header' from the first row of the dataset
header = df.iloc[0]
print(df.iloc[0])

0      first_name
1       last_name
2             age
3    preTestScore
Name: 0, dtype: object

In [9]:
# Rename the dataframe's column values with the header variable
df.rename(columns = header)

   first_name  last_name  age  preTestScore
0  first_name  last_name  age  preTestScore
1       Molly   Jacobson   52            24
2        Tina        Ali   36            31
3        Jake     Milner   24             2
4         Amy      Cooze   73             3

Source: https://chrisalbon.com/python/pandas_rename_column_headers.html